-- 1. Проанализировать какие запросы могут выполняться наиболее
-- часто в процессе работы приложения и добавить необходимые индексы.

SHOW INDEX from posts;
CREATE INDEX posts_head_idx ON posts(head);

SHOW INDEX from users;
CREATE INDEX users_username_idx ON users(username);

SHOW INDEX from profiles;
CREATE INDEX profiles_city_country_idx ON profiles(city, country);


-- 2. Задание на оконные функции
-- Построить запрос, который будет выводить следующие столбцы:
-- имя группы
-- среднее количество пользователей в группах
-- самый молодой пользователь в группе
-- самый старший пользователь в группе
-- общее количество пользователей в группе
-- всего пользователей в системе
-- отношение в процентах (общее количество пользователей в группе / всего пользователей в системе) * 100
